tukano-artillery-tests/logs/azure-blobs-15.txt
--------------------------------
Summary report @ 23:09:53(+0000)
--------------------------------

http.codes.200: ................................................................ 900
http.codes.204: ................................................................ 900
http.downloaded_bytes: ......................................................... 128358
http.request_rate: ............................................................. 54/sec
http.requests: ................................................................. 1800
http.response_time:
  min: ......................................................................... 122
  max: ......................................................................... 1044
  mean: ........................................................................ 310.2
  median: ...................................................................... 247.2
  p95: ......................................................................... 572.6
  p99: ......................................................................... 713.5
http.response_time.2xx:
  min: ......................................................................... 122
  max: ......................................................................... 1044
  mean: ........................................................................ 310.2
  median: ...................................................................... 247.2
  p95: ......................................................................... 572.6
  p99: ......................................................................... 713.5
http.responses: ................................................................ 1800
plugins.metrics-by-endpoint./rest/blobs/{{ id }}?token=token.codes.200: ........ 450
plugins.metrics-by-endpoint./rest/blobs/{{ id }}?token=token.codes.204: ........ 450
plugins.metrics-by-endpoint./rest/blobs/{{ userId }}?token=token.codes.204: .... 450
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}?pwd=pwd.codes.200: ....... 450
plugins.metrics-by-endpoint.response_time./rest/blobs/{{ id }}?token=token:
  min: ......................................................................... 226
  max: ......................................................................... 747
  mean: ........................................................................ 258
  median: ...................................................................... 247.2
  p95: ......................................................................... 295.9
  p99: ......................................................................... 518.1
plugins.metrics-by-endpoint.response_time./rest/blobs/{{ userId }}?token=token:
  min: ......................................................................... 531
  max: ......................................................................... 1044
  mean: ........................................................................ 573.2
  median: ...................................................................... 561.2
  p95: ......................................................................... 632.8
  p99: ......................................................................... 963.1
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}?pwd=pwd:
  min: ......................................................................... 122
  max: ......................................................................... 617
  mean: ........................................................................ 151.6
  median: ...................................................................... 141.2
  p95: ......................................................................... 186.8
  p99: ......................................................................... 424.2
vusers.completed: .............................................................. 450
vusers.created: ................................................................ 450
vusers.created_by_name.Blobs: .................................................. 450
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1580.4
  max: ......................................................................... 2218.6
  mean: ........................................................................ 1691.4
  median: ...................................................................... 1652.8
  p95: ......................................................................... 1978.7
  p99: ......................................................................... 2101.1