tukano-artillery-tests/logs/azure-blobs-33.txt
--------------------------------
Summary report @ 23:20:49(+0000)
--------------------------------

http.codes.200: ................................................................ 1980
http.codes.204: ................................................................ 1980
http.downloaded_bytes: ......................................................... 282756
http.request_rate: ............................................................. 126/sec
http.requests: ................................................................. 3960
http.response_time:
  min: ......................................................................... 83
  max: ......................................................................... 1686
  mean: ........................................................................ 313.8
  median: ...................................................................... 247.2
  p95: ......................................................................... 572.6
  p99: ......................................................................... 1022.7
http.response_time.2xx:
  min: ......................................................................... 83
  max: ......................................................................... 1686
  mean: ........................................................................ 313.8
  median: ...................................................................... 247.2
  p95: ......................................................................... 572.6
  p99: ......................................................................... 1022.7
http.responses: ................................................................ 3960
plugins.metrics-by-endpoint./rest/blobs/{{ id }}?token=token.codes.200: ........ 990
plugins.metrics-by-endpoint./rest/blobs/{{ id }}?token=token.codes.204: ........ 990
plugins.metrics-by-endpoint./rest/blobs/{{ userId }}?token=token.codes.204: .... 990
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}?pwd=pwd.codes.200: ....... 990
plugins.metrics-by-endpoint.response_time./rest/blobs/{{ id }}?token=token:
  min: ......................................................................... 164
  max: ......................................................................... 1292
  mean: ........................................................................ 258.8
  median: ...................................................................... 247.2
  p95: ......................................................................... 284.3
  p99: ......................................................................... 804.5
plugins.metrics-by-endpoint.response_time./rest/blobs/{{ userId }}?token=token:
  min: ......................................................................... 516
  max: ......................................................................... 1686
  mean: ........................................................................ 578.1
  median: ...................................................................... 561.2
  p95: ......................................................................... 620.3
  p99: ......................................................................... 1300.1
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}?pwd=pwd:
  min: ......................................................................... 83
  max: ......................................................................... 1040
  mean: ........................................................................ 159.6
  median: ...................................................................... 141.2
  p95: ......................................................................... 206.5
  p99: ......................................................................... 685.5
vusers.completed: .............................................................. 990
vusers.created: ................................................................ 990
vusers.created_by_name.Blobs: .................................................. 990
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1577.5
  max: ......................................................................... 3121
  mean: ........................................................................ 1729.7
  median: ...................................................................... 1652.8
  p95: ......................................................................... 2566.3
  p99: ......................................................................... 2836.2