tukano-artillery-tests/logs/azure-blobs-5.txt
--------------------------------
Summary report @ 23:25:56(+0000)
--------------------------------

http.codes.200: ................................................................ 300
http.codes.204: ................................................................ 300
http.downloaded_bytes: ......................................................... 42576
http.request_rate: ............................................................. 19/sec
http.requests: ................................................................. 600
http.response_time:
  min: ......................................................................... 134
  max: ......................................................................... 602
  mean: ........................................................................ 297.4
  median: ...................................................................... 242.3
  p95: ......................................................................... 561.2
  p99: ......................................................................... 572.6
http.response_time.2xx:
  min: ......................................................................... 134
  max: ......................................................................... 602
  mean: ........................................................................ 297.4
  median: ...................................................................... 242.3
  p95: ......................................................................... 561.2
  p99: ......................................................................... 572.6
http.responses: ................................................................ 600
plugins.metrics-by-endpoint./rest/blobs/{{ id }}?token=token.codes.200: ........ 150
plugins.metrics-by-endpoint./rest/blobs/{{ id }}?token=token.codes.204: ........ 150
plugins.metrics-by-endpoint./rest/blobs/{{ userId }}?token=token.codes.204: .... 150
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}?pwd=pwd.codes.200: ....... 150
plugins.metrics-by-endpoint.response_time./rest/blobs/{{ id }}?token=token:
  min: ......................................................................... 226
  max: ......................................................................... 289
  mean: ........................................................................ 244.9
  median: ...................................................................... 242.3
  p95: ......................................................................... 257.3
  p99: ......................................................................... 273.2
plugins.metrics-by-endpoint.response_time./rest/blobs/{{ userId }}?token=token:
  min: ......................................................................... 539
  max: ......................................................................... 602
  mean: ........................................................................ 554
  median: ...................................................................... 550.1
  p95: ......................................................................... 572.6
  p99: ......................................................................... 596
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}?pwd=pwd:
  min: ......................................................................... 134
  max: ......................................................................... 174
  mean: ........................................................................ 145.7
  median: ...................................................................... 144
  p95: ......................................................................... 159.2
  p99: ......................................................................... 172.5
vusers.completed: .............................................................. 150
vusers.created: ................................................................ 150
vusers.created_by_name.Blobs: .................................................. 150
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1591.4
  max: ......................................................................... 1858.3
  mean: ........................................................................ 1641.3
  median: ...................................................................... 1620
  p95: ......................................................................... 1686.1
  p99: ......................................................................... 1720.2